tap "ankitpokhrel/jira-cli"
tap "borkdude/brew"
tap "clojure/tools"
tap "heroku/brew"
tap "homebrew/services"
tap "jonathanruiz/tap"
tap "koekeishiya/formulae"
tap "rsteube/tap"
tap "sst/tap"
tap "valkyrie00/bbrew"
tap "zenibako/jira-cli"
tap "zerotier/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# To build and run Airflow DAGs locally and interact with the Astronomer API
brew "astro"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Platform built on V8 to build network applications
brew "node", link: false
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Core application library for C
brew "glib"
# Parser generator
brew "bison"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Multi-shell multi-command argument completer
brew "carapace"
# Cross-platform make
brew "cmake"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool to generate cobra applications and commands
brew "cobra-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Spellchecker wrapping library
brew "enchant"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Open-source GitLab command-line tool
brew "glab"
# Image manipulation
brew "netpbm"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Command-line utility for Home Assistant
brew "homeassistant-cli"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Development kit for the Java programming language
brew "openjdk"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Git-compatible distributed version control system
brew "jj"
# Development kit for the Java programming language
brew "openjdk@21"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the Double Ratchet cryptographic ratchet
brew "libolm"
# YAML Parser
brew "libyaml"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt@5"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Command-line YAML and XML processor that wraps jq
brew "python-yq", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Smart session manager for the terminal
brew "sesh"
# Command-line toolkit for Salesforce development
brew "sf"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Terminal-based client for Spotify
brew "spotify-tui"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# User interface to the TELNET protocol
brew "telnet"
# Feature rich terminal file transfer and explorer
brew "termscp"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Command-line XML and HTML beautifier and content extractor
brew "xq", link: false
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# Native, fast starting Clojure interpreter for scripting.
brew "borkdude/brew/babashka"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A TUI built for managing and waking your devices using Wake-on-LAN.
brew "jonathanruiz/tap/wakey"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# define simple completions using a spec file
brew "rsteube/tap/carapace-spec"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# A simple TUI tool to make your homebrew bold.
brew "valkyrie00/bbrew/bbrew"
# GPU-accelerated terminal emulator
cask "alacritty"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Tools to protect your emails and files
cask "gpg-suite"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Neovim Client
cask "neovide-app"
# MacBook Notch utility
cask "quakenotch"
# CLI tools for Salesforce
cask "salesforce-cli"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Free and open source web app scanner
cask "zap"
# Mesh VPN client
cask "zerotier-one"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.cpp-helper"
vscode "astro-build.astro-vscode"
vscode "augustocdias.tasks-shell-input"
vscode "christian-kohler.npm-intellisense"
vscode "chrmarti.network-proxy-test"
vscode "chuckjonas.apex-pmd"
vscode "codezombiech.gitignore"
vscode "compulim.vscode-mocha"
vscode "cpylua.language-postcss"
vscode "cspotcode.vscode-mocha-latte"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "financialforce.lana"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "juanblanco.solidity"
vscode "kendoui.kendotemplatewizard"
vscode "linhmtran168.mac-ca-vscode"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "midouest.playdate-debug"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nomicfoundation.hardhat-solidity"
vscode "orta.vscode-jest"
vscode "piersdeseilligny.betterfountain"
vscode "redhat.vscode-xml"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "sumneko.lua"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
