tap "ankitpokhrel/jira-cli"
tap "borkdude/brew"
tap "clojure/tools"
tap "homebrew/bundle"
brew "node"
brew "aws-cdk"
brew "glib"
brew "coreutils"
brew "cryptography"
brew "curl"
brew "fd"
brew "harfbuzz"
brew "icu4c@76"
brew "pango"
brew "ffmpeg"
brew "fswatch"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "go"
brew "netpbm"
brew "libtool"
brew "graphviz"
brew "grep"
brew "openjdk"
brew "jdtls"
brew "openjdk@21"
brew "jmeter"
brew "jq"
brew "luarocks"
brew "maven"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "pipx"
brew "powerlevel10k"
brew "python-yq"
brew "python@3.10"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "rust"
brew "sf", link: false
brew "sonar-scanner"
brew "stylua"
brew "terraform"
brew "tmux"
brew "weechat"
brew "yarn"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "borkdude/brew/babashka"
brew "clojure/tools/clojure"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "mitmproxy"
cask "sf"
cask "visual-studio-code"
cask "zap"
vscode "chrmarti.network-proxy-test"
vscode "chuckjonas.apex-pmd"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "financialforce.lana"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "linhmtran168.mac-ca-vscode"
vscode "redhat.vscode-xml"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "vscodevim.vim"
