tap "ankitpokhrel/jira-cli"
tap "borkdude/brew"
tap "clojure/tools"
tap "heroku/brew"
tap "homebrew/services"
brew "node"
brew "aws-cdk"
brew "coreutils"
brew "cryptography"
brew "curl"
brew "enchant"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "gcc"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "glib"
brew "go"
brew "graphviz"
brew "grep"
brew "htop"
brew "hugo"
brew "hunspell"
brew "icu4c@76"
brew "isl"
brew "jdtls"
brew "jmeter"
brew "jq"
brew "luarocks"
brew "libtool"
brew "maven"
brew "neofetch"
brew "neovim"
brew "netpbm"
brew "nghttp2"
brew "nvm"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "openjdk@21"
brew "pipx"
brew "pnpm"
brew "postgresql@14"
brew "powerlevel10k"
brew "pyenv"
brew "pyqt@5"
brew "python-yq"
brew "python@3.10", link: false
brew "python@3.12"
brew "python@3.13"
brew "python@3.9"
brew "qt@5"
brew "ripgrep"
brew "rust"
brew "sf", link: false
brew "sonar-scanner"
brew "spotify-tui"
brew "stylua"
brew "telnet"
brew "terraform"
brew "tmux"
brew "weechat"
brew "wget"
brew "xq", link: false
brew "yarn"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "borkdude/brew/babashka"
brew "clojure/tools/clojure"
brew "heroku/brew/heroku"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "mitmproxy"
cask "neovide"
cask "sf"
cask "visual-studio-code"
cask "zap"
vscode "alefragnani.project-manager"
vscode "amiralizadeh9480.cpp-helper"
vscode "astro-build.astro-vscode"
vscode "augustocdias.tasks-shell-input"
vscode "christian-kohler.npm-intellisense"
vscode "chrmarti.network-proxy-test"
vscode "chuckjonas.apex-pmd"
vscode "codezombiech.gitignore"
vscode "compulim.vscode-mocha"
vscode "cpylua.language-postcss"
vscode "cspotcode.vscode-mocha-latte"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "esbenp.prettier-vscode"
vscode "financialforce.lana"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "juanblanco.solidity"
vscode "kendoui.kendotemplatewizard"
vscode "linhmtran168.mac-ca-vscode"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "midouest.playdate-debug"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nomicfoundation.hardhat-solidity"
vscode "orta.vscode-jest"
vscode "piersdeseilligny.betterfountain"
vscode "redhat.vscode-xml"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "sumneko.lua"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "zxh404.vscode-proto3"
